# **Computational Methods**
## **Introduction to Data Sets**

Written by Niv Keren, nivkeren1@mail.tau.ac.il 

Based on [Python Numpy Tutorial](https://cs231n.github.io/python-numpy-tutorial/)  by Justin Johnson,
from Stanford CS231n class.

*Computational Methods* class: 0341-2300

2020/Semester I; Tuesdays 14:00-16:00

FACULTY OF EXACT SCIENCES | GEOPHYSICS & PLANETARY SCIENCES  
Tel Aviv University

---

## **Pandas**
Pandas is a library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.[(from wikipedia)](https://en.wikipedia.org/wiki/Pandas_(software)

* DataFrame object for data manipulation with integrated indexing.
* Tools for reading and writing data between in-memory data structures and different file formats.
* Data alignment and integrated handling of missing data.
* Reshaping and pivoting of data sets.
* Label-based slicing, fancy indexing, and subsetting of large data sets.
* Data structure column insertion and deletion.
* Group by engine allowing split-apply-combine operations on data sets.
* Data set merging and joining.
* Hierarchical axis indexing to work with high-dimensional data in a lower-dimensional data structure.
* Time series-functionality: Date range generation[4] and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging.
* Provides data filtration.  
[**Pandas Documantation**](https://pandas.pydata.org/pandas-docs/stable/)

In [63]:
import numpy as np
import pandas as pd

### **Seires**
Creating a **Series** by passing a `list` of values, letting pandas create a default integer index:

In [64]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### **DataFrame**
Creating a **DataFrame** by passing a `NumPy array`, with a datetime index and labeled columns:

In [65]:
dates = pd.date_range('20130101', periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [66]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.127415 -0.381578 -0.378245  1.411338
2013-01-02  2.365536 -0.432591 -0.178182  0.792020
2013-01-03  0.373301  0.631485  0.854472 -0.819015
2013-01-04 -0.823661 -0.874600  0.819099 -0.360536
2013-01-05  0.589507 -1.120037 -0.208070 -1.367557
2013-01-06 -0.023855 -0.527679  1.271884  0.436319

In [67]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [68]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [69]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### **Viewing Data**

In [70]:
df.head()

                   A         B         C         D
2013-01-01 -1.127415 -0.381578 -0.378245  1.411338
2013-01-02  2.365536 -0.432591 -0.178182  0.792020
2013-01-03  0.373301  0.631485  0.854472 -0.819015
2013-01-04 -0.823661 -0.874600  0.819099 -0.360536
2013-01-05  0.589507 -1.120037 -0.208070 -1.367557

In [71]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.823661 -0.874600  0.819099 -0.360536
2013-01-05  0.589507 -1.120037 -0.208070 -1.367557
2013-01-06 -0.023855 -0.527679  1.271884  0.436319

**`DataFrame.to_numpy()`** gives a NumPy representation of the underlying data.  
Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: **NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column.** When you call `DataFrame.to_numpy()`, pandas will find the NumPy dtype that can hold *all* of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

In [72]:
df.to_numpy()

array([[-1.12741506, -0.3815785 , -0.37824527,  1.41133759],
       [ 2.36553637, -0.43259133, -0.1781821 ,  0.79201996],
       [ 0.37330145,  0.63148454,  0.85447169, -0.81901531],
       [-0.82366052, -0.87460029,  0.81909901, -0.36053589],
       [ 0.58950711, -1.12003659, -0.20806984, -1.36755748],
       [-0.02385482, -0.52767922,  1.27188369,  0.43631895]])

In [73]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

**Note:** `DataFrame.to_numpy()`does *not* include the index or column labels in the output.

**`describe()`** shows a quick statistic summary of your data:

In [74]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.225569 -0.450834  0.363493  0.015428
std    1.243173  0.601641  0.699154  1.046814
min   -1.127415 -1.120037 -0.378245 -1.367557
25%   -0.623709 -0.787870 -0.200598 -0.704395
50%    0.174723 -0.480135  0.320458  0.037892
75%    0.535456 -0.394332  0.845629  0.703095
max    2.365536  0.631485  1.271884  1.411338

Transposing your data:

In [75]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.127415    2.365536    0.373301   -0.823661    0.589507   -0.023855
B   -0.381578   -0.432591    0.631485   -0.874600   -1.120037   -0.527679
C   -0.378245   -0.178182    0.854472    0.819099   -0.208070    1.271884
D    1.411338    0.792020   -0.819015   -0.360536   -1.367557    0.436319

### **Selection**

Selecting a single column, which yields a Series

In [76]:
df['A']

2013-01-01   -1.127415
2013-01-02    2.365536
2013-01-03    0.373301
2013-01-04   -0.823661
2013-01-05    0.589507
2013-01-06   -0.023855
Freq: D, Name: A, dtype: float64

In [77]:
df.A

2013-01-01   -1.127415
2013-01-02    2.365536
2013-01-03    0.373301
2013-01-04   -0.823661
2013-01-05    0.589507
2013-01-06   -0.023855
Freq: D, Name: A, dtype: float64

Selecting via `[]`, which slices the rows.

In [78]:
df[0:4]

                   A         B         C         D
2013-01-01 -1.127415 -0.381578 -0.378245  1.411338
2013-01-02  2.365536 -0.432591 -0.178182  0.792020
2013-01-03  0.373301  0.631485  0.854472 -0.819015
2013-01-04 -0.823661 -0.874600  0.819099 -0.360536

In [79]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  2.365536 -0.432591 -0.178182  0.792020
2013-01-03  0.373301  0.631485  0.854472 -0.819015
2013-01-04 -0.823661 -0.874600  0.819099 -0.360536

**Selection by label**  
For getting a cross section using a label:

In [80]:
df.loc[dates[0]]

A   -1.127415
B   -0.381578
C   -0.378245
D    1.411338
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [81]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  2.365536 -0.432591
2013-01-03  0.373301  0.631485
2013-01-04 -0.823661 -0.874600

Getting a scalar value:

In [82]:
df.loc[dates[0], 'A']

-1.127415057262261

**Selection by position**  
Select via the position of the passed integers:

In [83]:
df.iloc[3]

A   -0.823661
B   -0.874600
C    0.819099
D   -0.360536
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [84]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.823661 -0.874600
2013-01-05  0.589507 -1.120037

For slicing columns explicitly:

In [85]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.381578 -0.378245
2013-01-02 -0.432591 -0.178182
2013-01-03  0.631485  0.854472
2013-01-04 -0.874600  0.819099
2013-01-05 -1.120037 -0.208070
2013-01-06 -0.527679  1.271884

In [86]:
df.iloc[1, 1]

-0.4325913265624429

**Boolean indexing**  
Using a single column’s values to select data.

In [87]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  2.365536 -0.432591 -0.178182  0.792020
2013-01-03  0.373301  0.631485  0.854472 -0.819015
2013-01-05  0.589507 -1.120037 -0.208070 -1.367557

Selecting values from a DataFrame where a boolean condition is met.

In [88]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  1.411338
2013-01-02  2.365536       NaN       NaN  0.792020
2013-01-03  0.373301  0.631485  0.854472       NaN
2013-01-04       NaN       NaN  0.819099       NaN
2013-01-05  0.589507       NaN       NaN       NaN
2013-01-06       NaN       NaN  1.271884  0.436319

Using the **`isin()`** method for filtering:

In [89]:
df_copy = df.copy()
df_copy['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df_copy

                   A         B         C         D      E
2013-01-01 -1.127415 -0.381578 -0.378245  1.411338    one
2013-01-02  2.365536 -0.432591 -0.178182  0.792020    one
2013-01-03  0.373301  0.631485  0.854472 -0.819015    two
2013-01-04 -0.823661 -0.874600  0.819099 -0.360536  three
2013-01-05  0.589507 -1.120037 -0.208070 -1.367557   four
2013-01-06 -0.023855 -0.527679  1.271884  0.436319  three

In [90]:
df_copy[df_copy['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.373301  0.631485  0.854472 -0.819015   two
2013-01-05  0.589507 -1.120037 -0.208070 -1.367557  four

### **Setting**
Setting a new column automatically aligns the data by the indexes.

In [91]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [92]:
df['F'] = s1

Setting values by label:

In [93]:
df.loc[dates[0], 'A'] = 0

Setting values by position:

In [94]:
df.iloc[0, 1] = 0

Setting by assigning with a NumPy array:

In [95]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [96]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.378245  5  NaN
2013-01-02  2.365536 -0.432591 -0.178182  5  1.0
2013-01-03  0.373301  0.631485  0.854472  5  2.0
2013-01-04 -0.823661 -0.874600  0.819099  5  3.0
2013-01-05  0.589507 -1.120037 -0.208070  5  4.0
2013-01-06 -0.023855 -0.527679  1.271884  5  5.0

In [97]:
df_copy = df.copy()
df_copy[df_copy < 0] = -df_copy # abselute value
df_copy

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.378245  5  NaN
2013-01-02  2.365536  0.432591  0.178182  5  1.0
2013-01-03  0.373301  0.631485  0.854472  5  2.0
2013-01-04  0.823661  0.874600  0.819099  5  3.0
2013-01-05  0.589507  1.120037  0.208070  5  4.0
2013-01-06  0.023855  0.527679  1.271884  5  5.0

## **Operations**
### **Stats**
Operations in general exclude missing data.

In [98]:
df.mean()

A    0.413472
B   -0.387237
C    0.363493
D    5.000000
F    3.000000
dtype: float64

In [99]:
df.mean(axis=1)

2013-01-01    1.155439
2013-01-02    1.550953
2013-01-03    1.771852
2013-01-04    1.424168
2013-01-05    1.652280
2013-01-06    2.144070
Freq: D, dtype: float64

More statiscal methods are:  
**`max()`**,  **`median()`**,  **`var()`**,  **`cov()`** ...
### **Histogramming**

In [105]:
s = pd.Series(np.random.randint(0, 5, size=10))
s

0    4
1    3
2    2
3    0
4    1
5    3
6    2
7    4
8    2
9    1
dtype: int32

In [106]:
s.value_counts()

2    3
4    2
3    2
1    2
0    1
dtype: int64

## **Merge**
### **Concat**
Merges pandas objects along a particular axis with optional set logic along the other axes.

In [107]:
df = pd.DataFrame(np.random.randn(3, 4))
df

          0         1         2         3
0  0.157533  1.036239 -0.892096  2.229252
1  0.458116 -1.131439  1.518480  0.456084
2  0.125829  1.102141  1.650731  1.289030

In [108]:
df1 = pd.DataFrame(np.random.randn(3, 4))
df1

          0         1         2         3
0  0.918047 -0.623592 -1.136977 -0.750821
1  1.755173 -0.272242 -1.025121 -0.533073
2 -0.852676  1.097720  0.233271 -0.174595

In [110]:
concat_df = pd.concat([df, df1])
concat_df

          0         1         2         3
0  0.157533  1.036239 -0.892096  2.229252
1  0.458116 -1.131439  1.518480  0.456084
2  0.125829  1.102141  1.650731  1.289030
0  0.918047 -0.623592 -1.136977 -0.750821
1  1.755173 -0.272242 -1.025121 -0.533073
2 -0.852676  1.097720  0.233271 -0.174595

In [113]:
concat_df = concat_df.reset_index()
concat_df

   index         0         1         2         3
0      0  0.157533  1.036239 -0.892096  2.229252
1      1  0.458116 -1.131439  1.518480  0.456084
2      2  0.125829  1.102141  1.650731  1.289030
3      0  0.918047 -0.623592 -1.136977 -0.750821
4      1  1.755173 -0.272242 -1.025121 -0.533073
5      2 -0.852676  1.097720  0.233271 -0.174595

### **Join**
Merges by index, possibly different columns

In [165]:
left = pd.DataFrame({'lkey': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'rkey': ['bar', 'foo'], 'rval': [4, 5]})

In [159]:
left

  lkey  lval
0  foo     1
1  bar     2

In [160]:
right

  rkey  rval
0  bar     4
1  foo     5

In [161]:
left.join(right)

  lkey  lval rkey  rval
0  foo     1  bar     4
1  bar     2  foo     5

In [162]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['bar', 'foo'], 'rval': [4, 5]})

In [171]:
# left.merge(right, on='key')
left.merge(right, how='inner', left_on='lkey', right_on='rkey')

  lkey  lval rkey  rval
0  foo     1  foo     5
1  bar     2  bar     4

---
## **Data Sets or Datasets**
A collection of data.  
Few examples:
* **Tabular data -**  data set corresponds to one or more database tables, where every column of a table represents a particular variable, and each row corresponds to a given record of the data set in question.
* **Images data -** collection of images. Can be aloso represented in a table
* **Time-stamped data -**  Dataset which has a concept of time ordering defining the sequence that each data point was either captured (event time) or collected (processed time).
* **Spatial Data -** Some objects have spatial attributes, such as positions or areas, as well as other types of attributes.

### **Tabular Data**
Two very common formats to save tabular data are:
1. **CSV files -** *comma separated values*. Delimited text file that uses a comma to separate values. A CSV file stores tabular data (numbers and text) in plain text. Each line of the file is a data record. Each record consists of one or more fields, separated by commas.
2. **JSON files -** *JavaScript Object Notation*. Is an open-standard file format that uses human-readable text to transmit data objects consisting of attribute–value pairs and array data types

##### **CSV Example:**  
"year","state","month","number","date"  
1998,"Acre","Janeiro",0,1998-01-01  
1999,"Acre","Janeiro",0,1999-01-01  
2000,"Acre","Janeiro",0,2000-01-01  
2001,"Acre","Janeiro",0,2001-01-01  
2002,"Acre","Janeiro",0,2002-01-01  
2003,"Acre","Janeiro",10,2003-01-01  
2004,"Acre","Janeiro",0,2004-01-01

An easy way to read CSV files with pandas **`read_csv()`** command

In [174]:
df_amazon = pd.read_csv('files/amazon1.csv', encoding="windows-1252")

In [177]:
df_amazon.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  01/01/1998
1  1999  Acre  Janeiro     0.0  01/01/1999
2  2000  Acre  Janeiro     0.0  01/01/2000
3  2001  Acre  Janeiro     0.0  01/01/2001
4  2002  Acre  Janeiro     0.0  01/01/2002

In [178]:
len(df_amazon)

6454

**JSON Example:**